Tekla Open API Reference for Tekla Structures 2025
Surfacing.Attributes Property
 The attributes of the surfacing. For more information see Surfacing.SurfacingAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Surfacing.SurfacingAttributes Attributes { get; set; }
Public Property Attributes As Surfacing.SurfacingAttributes
	Get
	Set
Property Value
Type: Surfacing.SurfacingAttributes
See Also
Reference
Surfacing Class
Tekla.Structures.Drawing Namespace